# 算数运算符: + - * / % // **
# print(f"10 + 4 = {10 + 4}") #加法 14
# print(f"10 - 4 = {10 - 4}") #减法 6
# print(f"10 * 4 = {10 * 4}") #乘法 40
# print(f"10 / 4 = {10 / 4}") #除法 2.5
# print(f"10 % 4 = {10 % 4}") #整除 2
# print(f"10 // 4 = {10 // 4}") #取余 2
# print(f"10 ** 4 = {10 ** 4}") #指数 10000

#算数运算符优先级: ** ---> * / % // ---> + - (如果有括号,括号的优先级最高)
# print(f"0.1 + 10 / 4 ** 2 = {0.1 + 10 / 4 ** 2}")

#请输入两个数x,y,计算输出x+y和x-y的值
#可能有整数或者小数,使用float来转换
# x = float(input("请输入x的值"))
# y = float(input("请输入y的值"))
# print(f"计算{x} + {y} = {x + y}")
#计算0.5-0.4的时候出现0.09999999999999998,这是因为计算机无法用二进制表示全部小数,所以计算的时候会出现精度损失,这是正常情况
# print(f"计算{x} - {y} = {x - y}")

#案例一:计算输入的三个整数的平均数
# a = int(input("请输入整数a="))
# b = int(input("请输入整数b="))
# c = int(input("请输入整数c="))
# print(f"计算输入三个整数的平均值:\n({a} + {b} + {c})/3 = {(a+b+c)/3}")

#案例二:输入梯形的上底,下底,高,然后计算梯形的面积
# up = float(input("请输入梯形的上底:"))
# down = float(input("请输入梯形的下底:"))
# high = float(input("请输入梯形的高:"))
# print(f"计算梯形面积:\n({up} + {down}) * {high} / 2 = {(up + down) * high /2}")

#案例三:输入圆的半径,然后计算圆的周长和面积(周长:2Πr, 面积:Πr^2)
# r = float(input("请输入圆的半径:"))
# print(f"计算圆的周长:\n2*Π*{r} = {2*3.14*r}")
# print(f"计算圆的面积:\nΠ*{r}^2 = {3.14*r**2}")

#案例四:输入身高体重计算身体质量指数BMI并输出(BMT = 体重(kg) / 身高(m)^2)
# weight = float(input("请输入体重(kg):"))
# high = float(input("请输入身高(m)"))
# print(f"计算身体质量指数BMT:\n{weight} / {high}**2 = {weight/high**2}")


#赋值运算符 = += -= *= /= %= //= **=
# num = 85
# print(f"num = {num}")
# num += 10 #num = num + 10
# print(f"num += 10 之后, num = {num}")
# num -= 10 #num = num - 10
# print(f"num -= 10 之后, num = {num}")
# num *= 10 #num = num * 10
# print(f"num *= 10 之后, num = {num}")
# num /= 10 #num = num / 10
# print(f"num /= 10 之后, num = {num}")
# num //= 10 #num = num // 10
# print(f"num //= 10 之后, num = {num}")
# num %= 3 #num = num % 3
# print(f"num %= 10 之后, num = {num}")
# num **= 3 #num = num ^ 3
# print(f"num **= 10 之后, num = {num}")


# 比较运算符 == != > < >= <=
# print(f"100 == 100 吗? {"100" == "100"}")
# print(f"{100} == {100} 吗? {100 == 100}")
# print(f"100 != 100 吗? {100 != 100}")
# print(f"100 >= 100 吗? {100 >= 100}")
# print(f"100 <= 100 吗? {100 <= 100}")
# print(f"100 < 100 吗? {100 < 100}")
# print(f"100 > 100 吗? {100 > 100}")

# 逻辑运算符
#案例一: 键盘输入一个整数,判断这个数字是否在10-20之间
# nub1 = int(input("请输入一个整数"))

#案例二: 键盘输入一个整数,判断这个数字是否不在10-20之间
nub2 = int(input("请输入一个整数"))
print(f"输入数字{nub2}不在10-20之间吗?\t{nub2<10 or nub2>20}")
